# COMEÇANDO A TRILHA DE DADOS
COM O BANCO DE DADOS DO RODRIGÃO

In [2]:
#importando a biblioteca pandas
import pandas as pd

## 03 Importando um base de dados

In [3]:
#importando o dataframe do rodrigao
dados = pd.read_csv(r"./datasets/venda-de-carros.csv")

In [4]:
# imprimindo os dados do dataframe
print(dados)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [5]:
# Método .head() exibe as 5 primeiras linhas da base de dados por padrão, ou quantas linhas eu
# quiser passando o valor dentro do head
dados.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [6]:
# exibindo 8 linhas
dados.head(8)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00

In [7]:
dados.head(10)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

## 04 Informações da base de dados

In [8]:
#4 Informações da base de dados
dados.info()
#Método .info() exibe as informações da base:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

**<class 'pandas.core.frame.DataFrame'>** informa que a base é um DataFrame (formato de base de
dados no python). </br>
**RangeIndex: 10 entries, 0 to 9: informa que tem 10 linhas, e o index vai de 0 até 9.** </br>
Non-Null Count: informa se possui valores nulos em cada coluna. </br>
Dtype: informa o tipo de dado de cada coluna.

## 05 DataFrame

In [9]:
type(dados)

pandas.core.frame.DataFrame

In [10]:
dados.shape
#O atributo .shape retorna quantas linhas e colunas tem no DataFrame:

(10, 5)

In [11]:
# Criando um DataFrame:
# Função .DataFrame() do pandas cria um DataFrame, podemos passar um dicionário para criar:
pessoasDeUmaEmpresa = pd.DataFrame({
    "nome": ["Lucas Marcelo", "Richard Ribeiro", "Fabio Henrique"],
    "idade": [41 ,19 , 27],
    "peso": [81.5, 65.2, 70]
})

In [12]:
# exibindo o valor de um dataframe criado acima
print(pessoasDeUmaEmpresa)

              nome  idade  peso
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

In [13]:
# exibindo o valor do dataframe
pessoasDeUmaEmpresa.head(3)

              nome  idade  peso
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

In [14]:
# exibindo as informações do dataframe
pessoasDeUmaEmpresa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nome    3 non-null      object
 1   idade   3 non-null      int64
 2   peso    3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

### ✏️ Renomeando Colunas em um DataFrame (`pandas`)

Existem duas formas comuns de renomear colunas em um DataFrame:

---

#### ✅ 1. Usando o método `.rename()`:

```python
df.rename(columns={"coluna_antiga": "coluna_nova"}, inplace=True)

Atributo **.columns** retorna uma “lista” com nome de todas as colunas, também é possível
armazenar em uma lista:

In [15]:
# exibindo uma "lista" com nome de todas as colunas
pessoasDeUmaEmpresa.columns

Index(['nome', 'idade', 'peso'], dtype='object')

In [16]:
# armazenando as colunas em uma lista
# pessoasDeUmaEmpresa = list(pessoasDeUmaEmpresa.columns)
# print(pessoasDeUmaEmpresa)

O método **.rename()** serve para renomear as colunas passando um dicionário, no exemplo abaixo </br>
estamos criando um novo DataFrame com as colunas renomeadas:

In [17]:
pessoasDeUmaEmpresaRenomeando = pessoasDeUmaEmpresa.rename(columns = {
    "nome": "Nome Completo", # renomeia a coluna de nome "nome" para "Nome Completo"
    "idade": "Idade" # renomeia a coluna de nome "idade" para "Idade"
})

print(pessoasDeUmaEmpresaRenomeando)

     Nome Completo  Idade  peso
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

É possível também renomear o DataFrame original, nesse caso pessoasDeUmaEmpresa, e continuar </br>
utilizando-o, basta colocar **inplace = True**, veja o exemplo:

In [18]:
pessoasDeUmaEmpresa.rename(columns = {
    "nome": "Nome Completo", # renomeia a coluna de nome "nome" para "Nome Completo"
    "idade": "Idade", # renomeia a coluna de nome "idade" para "Idade"
},
    inplace=True
)

print(pessoasDeUmaEmpresa)

     Nome Completo  Idade  peso
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

Outra forma de renomear é utilizando **.columns** e passando uma lista com os novos nomes:

In [19]:
pessoasDeUmaEmpresa.columns = ["NOME", "IDADE", "PESO"]

print(pessoasDeUmaEmpresa)

              NOME  IDADE  PESO
0    Lucas Marcelo     41  81.5
1  Richard Ribeiro     19  65.2
2   Fabio Henrique     27  70.0

### 06 Series

### 📊 Resumo sobre `pandas.Series` (Python)

- Uma `Series` é uma estrutura **unidimensional** do `pandas`, parecida com uma **coluna de uma planilha**.
- Armazena **valores** com **índices** associados (automáticos ou personalizados).
- Cada coluna de um `DataFrame` é, na verdade, uma `Series`.

#### ✅ Como criar uma `Series`:
```python
import pandas as pd

# Com lista
serie = pd.Series([10, 20, 30])

# Com índice personalizado
serie = pd.Series([10, 20, 30], index=['a', 'b', 'c'])

In [27]:
# exibi apenas os valores da coluna "Fabricante"
print(dados["Fabricante"])

print("\n")
# mostra o tipo da coluna "Fabricante", resulta em object("string")
type(dados["Fabricante"])

# mostra apenas os valores(sem os indices), Retorna um Array tipo NumPy
print("Exibindo apenas os valores")
print(dados["Fabricante"].values)

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Fabricante, dtype: object


Exibindo apenas os valores
['Toyota' 'Honda' 'Toyota' 'BMW' 'Nissan' 'Toyota' 'Honda' 'Honda'
 'Toyota' 'Nissan']

Criando uma Series: </br>
O método **.Series()** cria uma series, basta passar uma lista, ex:

In [21]:
series1 = pd.Series([5.5, 6.0, 9.5])
print(series1)

0    5.5
1    6.0
2    9.5
dtype: float64